bricks/olymp/olymp/ejik/2014s.org
#+HTML_DOCTYPE: html5
#+OPTIONS: toc:nil num:nil html5-fancy:t
#+MACRO: begin-block #+HTML: <div class="$1">
#+MACRO: end-block #+HTML: </div>

{{{begin-block(Page)}}}

* Вторая командная олимпиада по программированию Ёjik

*20 апреля 2014 года* состоится командная олимпиада по
программированию для начинающих Ёjik (произносится «ёжик»).  Это
командное соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется
один персональный компьютер и предлагается решить несколько задач. Для
решения участники могут использовать следующие языки программирования:
C/C++, C#, Java, Pascal, Python.

Задачи олимпиады рассчитаны на самый широкий круг участников: они в
большинстве своем не требуют знаний математики, выходящих за рамки
программы 6-7 класса, а также доступны школьникам, не овладевшим
целиком основами языка программирования (например, школьникам, не
владеющим строками или двумерными массивами, будут доступны
большинство задач).

Оценить уровень заданий можно посмотрев материалы [[./2013.html][предыдущей олимпиады]].

** Результаты

Вторая олимпиада Ёjik состоялась. В олимпиаде приняло участие 15 команд. Победителями стали:

1. КФМЛ, wolfpro (Радаев Вадим, 10)
2. КФМЛ + Школа №28, Киров (Ашихмин Анатолий 7, Клёпов Дмитрий 7, Кощеев Илья 7)
3. Лицей №21, Little Pony (Бронников Андрей 10, Злобин Илья 10, Саранцев Дмитрий 10)

Итоговая таблица:

|-----+------------------------------------------------+-------+-------+-------+-------+-----+-----+-------+--------+-------+-------|
|     | Команда                                        | A     | B     | C     | D     | E   | F   | G     | Задачи | Баллы | Место |
|-----+------------------------------------------------+-------+-------+-------+-------+-----+-----+-------+--------+-------+-------|
|     | <l>                                            | <c>   | <c>   | <c>   | <c>   | <c> | <c> | <c>   |    <c> |   <c> |   <c> |
| 015 | wolfpro (КФМЛ, Киров)                          | *100* | *100* | *97*  | *100* | 4   | 40  | *100* |      5 |   541 |     1 |
| 005 | Басик Jува и Дат.Нат (КФМЛ + Школа №28, Киров) | *100* | *100* | *99*  | *100* |     | 20  | *100* |      5 |   519 |     2 |
| 001 | Little Pony (Лицей №21, Киров)                 | *100* | *100* | 72    | *100* | 0   |     | 6     |      3 |   378 |     3 |
| 004 | КЭПЛ (Кировский экономико-правовой лицей)      | *100* | *100* | 70    | 72    |     | 34  | 0     |      2 |   376 |     4 |
| 008 | Talking Hamsters (КЛЕН, Киров)                 | *100* | *100* | 63    | *100* |     |     |       |      3 |   363 |     5 |
| 014 | Puzzle (Школа №28, Киров)                      | *100* | 71    | 40    | *95*  |     |     |       |      2 |   306 |     6 |
| 003 | 14515 (КФМЛ, Киров)                            | *100* | 63    | *100* | 28    |     |     | 2     |      2 |   293 |     7 |
| 002 | LIK (Лицей №21, Киров)                         | *100* | *99*  | 56    | 15    | 3   |     |       |      2 |   273 |     8 |
| 006 | ВТЛ-22 (ВТЛ, Киров)                            | *100* |       | 63    | 16    |     | 5   |       |      1 |   249 |     9 |
| 013 | КЛЕН-89 (Кировский лицей естественных наук)    | *96*  | *97*  | 8     |       |     |     | 0     |      2 |   201 |    10 |
| 009 | Трояны (МКОУ СОШ с. Пасегово)                  | *100* | 16    | 55    | 12    | 3   | 3   | 3     |      1 |   192 |    11 |
| 011 | 1+2 (Гимназия №46, Киров)                      | *100* | 16    | 32    | 28    |     |     |       |      1 |   176 |    12 |
| 007 | Encoding cats (ВТЛ, Киров)                     | *100* | 16    | 48    | 4     | 0   | 3   | 1     |      1 |   172 |    13 |
| 012 | КЛЕН7 (Кировский лицей естественных наук)      | *97*  | 16    | 31    | 0     |     |     | 0     |      1 |   144 |    14 |
| 010 | Молох (МБОУ СОШ№ 70, Киров)                    |       |       |       |       |     |     |       |      0 |     0 |    15 |
|-----+------------------------------------------------+-------+-------+-------+-------+-----+-----+-------+--------+-------+-------|

** Материалы

+ [[./2014s-statements.pdf][Условия задач]]
+ [[./2014s-jury.7z][Архив жюри с решениями всех задач]]
+ [[./2014s-runs.7z][Архив подходов участников]]

** Место проведения

КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.

** Расписание

*20 апреля:*

+ 9:30 - 10:00 :: открытие, объяснение правил
+ 10:00 - 13:00 :: cоревнование
+ 13:00 :: подведение итогов


** Жюри олимпиады

+ Будин Николай Алексеевич, ФМЛ, г. Киров
+ Бураков Иван Александрович, Лицей, г. Кирово-Чепецк
+ Кайсин Илья Сергеевич, ФМЛ, г. Киров
+ Латышев Алексей Сергеевич, НИУ ИТМО, г. Санкт-Петербург
+ Пестов Олег Александрович, ФМЛ, г. Киров

** Организационный комитет

+ Пестов Олег Александрович, ФМЛ, г. Киров
+ Щепин Тимофей Аркадьевич, ФМЛ, г. Киров
+ Ямбарышева Светлана Юрьевна, ФМЛ, г. Киров

** Контакты

Пестов Олег Александрович, +7(909)143-5774, ~oleg.pestov@gmail.com~.

{{{end-block}}}
