bricks/olymp/olymp/ejik/2014s.html
<div class="Page">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Вторая командная олимпиада по программированию Ёjik</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>20 апреля 2014 года</b> состоится командная олимпиада по
программированию для начинающих Ёjik (произносится «ёжик»).  Это
командное соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется
один персональный компьютер и предлагается решить несколько задач. Для
решения участники могут использовать следующие языки программирования:
C/C++, C#, Java, Pascal, Python.
</p>

<p>
Задачи олимпиады рассчитаны на самый широкий круг участников: они в
большинстве своем не требуют знаний математики, выходящих за рамки
программы 6-7 класса, а также доступны школьникам, не овладевшим
целиком основами языка программирования (например, школьникам, не
владеющим строками или двумерными массивами, будут доступны
большинство задач).
</p>

<p>
Оценить уровень заданий можно посмотрев материалы <a href="./2013.html">предыдущей олимпиады</a>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Результаты</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Вторая олимпиада Ёjik состоялась. В олимпиаде приняло участие 15 команд. Победителями стали:
</p>

<ol class="org-ol">
<li>КФМЛ, wolfpro (Радаев Вадим, 10)
</li>
<li>КФМЛ + Школа №28, Киров (Ашихмин Анатолий 7, Клёпов Дмитрий 7, Кощеев Илья 7)
</li>
<li>Лицей №21, Little Pony (Бронников Андрей 10, Злобин Илья 10, Саранцев Дмитрий 10)
</li>
</ol>

<p>
Итоговая таблица:
</p>

<table>


<colgroup>
<col  class="right">

<col  class="left">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">Команда</th>
<th scope="col" class="center">A</th>
<th scope="col" class="center">B</th>
<th scope="col" class="center">C</th>
<th scope="col" class="center">D</th>
<th scope="col" class="center">E</th>
<th scope="col" class="center">F</th>
<th scope="col" class="center">G</th>
<th scope="col" class="center">Задачи</th>
<th scope="col" class="center">Баллы</th>
<th scope="col" class="center">Место</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">015</td>
<td class="left">wolfpro (КФМЛ, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center"><b>97</b></td>
<td class="center"><b>100</b></td>
<td class="center">4</td>
<td class="center">40</td>
<td class="center"><b>100</b></td>
<td class="center">5</td>
<td class="center">541</td>
<td class="center">1</td>
</tr>

<tr>
<td class="right">005</td>
<td class="left">Басик Jува и Дат.Нат (КФМЛ + Школа №28, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center"><b>99</b></td>
<td class="center"><b>100</b></td>
<td class="center"> </td>
<td class="center">20</td>
<td class="center"><b>100</b></td>
<td class="center">5</td>
<td class="center">519</td>
<td class="center">2</td>
</tr>

<tr>
<td class="right">001</td>
<td class="left">Little Pony (Лицей №21, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">72</td>
<td class="center"><b>100</b></td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center">6</td>
<td class="center">3</td>
<td class="center">378</td>
<td class="center">3</td>
</tr>

<tr>
<td class="right">004</td>
<td class="left">КЭПЛ (Кировский экономико-правовой лицей)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">70</td>
<td class="center">72</td>
<td class="center"> </td>
<td class="center">34</td>
<td class="center">0</td>
<td class="center">2</td>
<td class="center">376</td>
<td class="center">4</td>
</tr>

<tr>
<td class="right">008</td>
<td class="left">Talking Hamsters (КЛЕН, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>100</b></td>
<td class="center">63</td>
<td class="center"><b>100</b></td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">3</td>
<td class="center">363</td>
<td class="center">5</td>
</tr>

<tr>
<td class="right">014</td>
<td class="left">Puzzle (Школа №28, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center">71</td>
<td class="center">40</td>
<td class="center"><b>95</b></td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">306</td>
<td class="center">6</td>
</tr>

<tr>
<td class="right">003</td>
<td class="left">14515 (КФМЛ, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center">63</td>
<td class="center"><b>100</b></td>
<td class="center">28</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">2</td>
<td class="center">293</td>
<td class="center">7</td>
</tr>

<tr>
<td class="right">002</td>
<td class="left">LIK (Лицей №21, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center"><b>99</b></td>
<td class="center">56</td>
<td class="center">15</td>
<td class="center">3</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">273</td>
<td class="center">8</td>
</tr>

<tr>
<td class="right">006</td>
<td class="left">ВТЛ-22 (ВТЛ, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center">&#xa0;</td>
<td class="center">63</td>
<td class="center">16</td>
<td class="center"> </td>
<td class="center">5</td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">249</td>
<td class="center">9</td>
</tr>

<tr>
<td class="right">013</td>
<td class="left">КЛЕН-89 (Кировский лицей естественных наук)</td>
<td class="center"><b>96</b></td>
<td class="center"><b>97</b></td>
<td class="center">8</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">2</td>
<td class="center">201</td>
<td class="center">10</td>
</tr>

<tr>
<td class="right">009</td>
<td class="left">Трояны (МКОУ СОШ с. Пасегово)</td>
<td class="center"><b>100</b></td>
<td class="center">16</td>
<td class="center">55</td>
<td class="center">12</td>
<td class="center">3</td>
<td class="center">3</td>
<td class="center">3</td>
<td class="center">1</td>
<td class="center">192</td>
<td class="center">11</td>
</tr>

<tr>
<td class="right">011</td>
<td class="left">1+2 (Гимназия №46, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center">16</td>
<td class="center">32</td>
<td class="center">28</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">176</td>
<td class="center">12</td>
</tr>

<tr>
<td class="right">007</td>
<td class="left">Encoding cats (ВТЛ, Киров)</td>
<td class="center"><b>100</b></td>
<td class="center">16</td>
<td class="center">48</td>
<td class="center">4</td>
<td class="center">0</td>
<td class="center">3</td>
<td class="center">1</td>
<td class="center">1</td>
<td class="center">172</td>
<td class="center">13</td>
</tr>

<tr>
<td class="right">012</td>
<td class="left">КЛЕН7 (Кировский лицей естественных наук)</td>
<td class="center"><b>97</b></td>
<td class="center">16</td>
<td class="center">31</td>
<td class="center">0</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">1</td>
<td class="center">144</td>
<td class="center">14</td>
</tr>

<tr>
<td class="right">010</td>
<td class="left">Молох (МБОУ СОШ№ 70, Киров)</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">0</td>
<td class="center">15</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Материалы</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="./2014s-statements.pdf">Условия задач</a>
</li>
<li><a href="./2014s-jury.7z">Архив жюри с решениями всех задач</a>
</li>
<li><a href="./2014s-runs.7z">Архив подходов участников</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Место проведения</h3>
<div class="outline-text-3" id="text-1-3">
<p>
КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Расписание</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>20 апреля:</b>
</p>

<dl class="org-dl">
<dt> 9:30 - 10:00 </dt><dd>открытие, объяснение правил
</dd>
<dt> 10:00 - 13:00 </dt><dd>cоревнование
</dd>
<dt> 13:00 </dt><dd>подведение итогов
</dd>
</dl>
</div>
</div>


<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Жюри олимпиады</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Будин Николай Алексеевич, ФМЛ, г. Киров
</li>
<li>Бураков Иван Александрович, Лицей, г. Кирово-Чепецк
</li>
<li>Кайсин Илья Сергеевич, ФМЛ, г. Киров
</li>
<li>Латышев Алексей Сергеевич, НИУ ИТМО, г. Санкт-Петербург
</li>
<li>Пестов Олег Александрович, ФМЛ, г. Киров
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Организационный комитет</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Пестов Олег Александрович, ФМЛ, г. Киров
</li>
<li>Щепин Тимофей Аркадьевич, ФМЛ, г. Киров
</li>
<li>Ямбарышева Светлана Юрьевна, ФМЛ, г. Киров
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Контакты</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Пестов Олег Александрович, +7(909)143-5774, <code>oleg.pestov@gmail.com</code>.
</p>

</div>
</div>
</div>
</div>
